app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-11-06 18:24:24.687288"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(title: params[:title], description: params[:description])